zevorn/8051-ell/libraries/core/register/STC8x/STC8Ax_REG.h
/* IE2 */
#define ET4         0x40
#define ET3         0x20
#define ES4         0x10
#define ES3         0x08
#define ET2         0x04
#define ESPI        0x02
#define ES2         0x01

/* IP2 */
#define PI2C        0x40
#define PCMP        0x20
#define PX4         0x10
#define PPWMFD      0x08
#define PPWM        0x04
#define PSPI        0x02
#define PS2         0x01

/* IPH */
#define PPCAH       0x80
#define PLVDH       0x40
#define PADCH       0x20
#define PSH         0x10
#define PT1H        0x08
#define PX1H        0x04
#define PT0H        0x02
#define PX0H        0x01

/* IP2H */
#define PI2CH       0x40
#define PCMPH       0x20
#define PX4H        0x10
#define PPWMFDH     0x08
#define PPWMH       0x04
#define PSPIH       0x02
#define PS2H        0x01

/* INTCLKO */
#define EX4         0x40
#define EX3         0x20
#define EX2         0x10
#define T2CLKO      0x04
#define T1CLKO      0x02
#define T0CLKO      0x01

/* AUXINTIF */
#define INT4IF      0x40
#define INT3IF      0x20
#define INT2IF      0x10
#define T4IF        0x04
#define T3IF        0x02
#define T2IF        0x01

/* ISR register */
sfr IE   =   IE_ADDRESS;
sfr IE2  =  IE2_ADDRESS;
sfr IP   =   IP_ADDRESS;
sfr IP2  = IP2H_ADDRESS;
sfr IPH  =  IPH_ADDRESS;
sfr IP2H = IP2H_ADDRESS;
sfr INTCLKO  =  INTCLKO_ADDRESS;
sfr AUXINTIF = AUXINTIF_ADDRESS;

sbit EA   = IE^7;
sbit ELVD = IE^6;
sbit EADC = IE^5;
sbit ES   = IE^4;
sbit ET1  = IE^3;
sbit EX1  = IE^2;
sbit ET0  = IE^1;
sbit EX0  = IE^0;

sbit PPCA = IP^7;
sbit PLVD = IP^6;
sbit PADC = IP^5;
sbit PS   = IP^4;
sbit PT1  = IP^3;
sbit PX1  = IP^2;
sbit PT0  = IP^1;
sbit PX0  = IP^0;

/*--------------------------------------------------------
| @Description: GPIO peripherals                         |
--------------------------------------------------------*/

/* Base address define */
#define    GPIO_BASE       0x80U
#define    PxM1_BASE       0x93U
#define    PxM0_BASE       0x94U
#define BUS_SPEED_ADDRESS  0xA1U

/* There are internal extended 
ram areas below */
#define    PxPU_BASE     0xFE10U
#define    PxNCS_BASE    0xFE18U
#define    PxSR_BASE     0xFE20U
#define    PxDR_BASE     0xFE28U
#define    PxIE_BASE     0xFE30U

/* GPIO address define */
#define    GPIO_P0_ADDRESS  GPIO_BASE 
#define    GPIO_P1_ADDRESS      0x90U 
#define    GPIO_P2_ADDRESS      0xA0U
#define    GPIO_P3_ADDRESS      0xB0U 
#define    GPIO_P4_ADDRESS      0xC0U
#define    GPIO_P5_ADDRESS      0xC8U 
#define    GPIO_P6_ADDRESS      0xE8U 
#define    GPIO_P7_ADDRESS      0xF8U 

/*PxMx address define*/
#define    P0M1_ADDRESS  PxM1_BASE
#define    P1M1_ADDRESS      0x91U
#define    P2M1_ADDRESS      0x95U
#define    P3M1_ADDRESS      0xB1U
#define    P4M1_ADDRESS      0xB3U
#define    P5M1_ADDRESS      0xC9U
#define    P6M1_ADDRESS      0xCBU
#define    P7M1_ADDRESS      0xE1U
				 							    
#define    P0M0_ADDRESS  PxM0_BASE
#define    P1M0_ADDRESS      0x92U
#define    P2M0_ADDRESS      0x96U
#define    P3M0_ADDRESS      0xB2U
#define    P4M0_ADDRESS      0xB4U
#define    P5M0_ADDRESS      0xCAU
#define    P6M0_ADDRESS      0xCCU
#define    P7M0_ADDRESS      0xE2U

/*GPIO pull up address */
#define    P0PU_ADDRESS    (PxPU_BASE + 0x00U)
#define    P1PU_ADDRESS    (PxPU_BASE + 0x01U)
#define    P2PU_ADDRESS    (PxPU_BASE + 0x02U)
#define    P3PU_ADDRESS    (PxPU_BASE + 0x03U)
#define    P4PU_ADDRESS    (PxPU_BASE + 0x04U)
#define    P5PU_ADDRESS    (PxPU_BASE + 0x05U)
#define    P6PU_ADDRESS    (PxPU_BASE + 0x06U)
#define    P7PU_ADDRESS    (PxPU_BASE + 0x07U)

#define    GPIO_P0PU_ADDRESS    (PxPU_BASE + 0x00U)
#define    GPIO_P1PU_ADDRESS    (PxPU_BASE + 0x01U)
#define    GPIO_P2PU_ADDRESS    (PxPU_BASE + 0x02U)
#define    GPIO_P3PU_ADDRESS    (PxPU_BASE + 0x03U)
#define    GPIO_P4PU_ADDRESS    (PxPU_BASE + 0x04U)
#define    GPIO_P5PU_ADDRESS    (PxPU_BASE + 0x05U)
#define    GPIO_P6PU_ADDRESS    (PxPU_BASE + 0x06U)
#define    GPIO_P7PU_ADDRESS    (PxPU_BASE + 0x07U)

/*GPIO schmidt trigger address */
#define    P0NCS_ADDRESS   (PxNCS_BASE + 0x00U)
#define    P1NCS_ADDRESS   (PxNCS_BASE + 0x01U)
#define    P2NCS_ADDRESS   (PxNCS_BASE + 0x02U)
#define    P3NCS_ADDRESS   (PxNCS_BASE + 0x03U)
#define    P4NCS_ADDRESS   (PxNCS_BASE + 0x04U)
#define    P5NCS_ADDRESS   (PxNCS_BASE + 0x05U)
#define    P6NCS_ADDRESS   (PxNCS_BASE + 0x06U)
#define    P7NCS_ADDRESS   (PxNCS_BASE + 0x07U)

#define    GPIO_P0NCS_ADDRESS   (PxNCS_BASE + 0x00U)
#define    GPIO_P1NCS_ADDRESS   (PxNCS_BASE + 0x01U)
#define    GPIO_P2NCS_ADDRESS   (PxNCS_BASE + 0x02U)
#define    GPIO_P3NCS_ADDRESS   (PxNCS_BASE + 0x03U)
#define    GPIO_P4NCS_ADDRESS   (PxNCS_BASE + 0x04U)
#define    GPIO_P5NCS_ADDRESS   (PxNCS_BASE + 0x05U)
#define    GPIO_P6NCS_ADDRESS   (PxNCS_BASE + 0x06U)
#define    GPIO_P7NCS_ADDRESS   (PxNCS_BASE + 0x07U)

/* GPIO level conversion address */
#define    P0SR_ADDRESS    (PxSR_BASE + 0x00U)
#define    P1SR_ADDRESS    (PxSR_BASE + 0x01U)
#define    P2SR_ADDRESS    (PxSR_BASE + 0x02U)
#define    P3SR_ADDRESS    (PxSR_BASE + 0x03U)
#define    P4SR_ADDRESS    (PxSR_BASE + 0x04U)
#define    P5SR_ADDRESS    (PxSR_BASE + 0x05U)
#define    P6SR_ADDRESS    (PxSR_BASE + 0x06U)
#define    P7SR_ADDRESS    (PxSR_BASE + 0x07U)

#define    GPIO_P0SR_ADDRESS    (PxSR_BASE + 0x00U)
#define    GPIO_P1SR_ADDRESS    (PxSR_BASE + 0x01U)
#define    GPIO_P2SR_ADDRESS    (PxSR_BASE + 0x02U)
#define    GPIO_P3SR_ADDRESS    (PxSR_BASE + 0x03U)
#define    GPIO_P4SR_ADDRESS    (PxSR_BASE + 0x04U)
#define    GPIO_P5SR_ADDRESS    (PxSR_BASE + 0x05U)
#define    GPIO_P6SR_ADDRESS    (PxSR_BASE + 0x06U)
#define    GPIO_P7SR_ADDRESS    (PxSR_BASE + 0x07U)

/* GPIO drive current address */
#define    P0DR_ADDRESS    (PxDR_BASE + 0x00U)
#define    P1DR_ADDRESS    (PxDR_BASE + 0x01U)
#define    P2DR_ADDRESS    (PxDR_BASE + 0x02U)
#define    P3DR_ADDRESS    (PxDR_BASE + 0x03U)
#define    P4DR_ADDRESS    (PxDR_BASE + 0x04U)
#define    P5DR_ADDRESS    (PxDR_BASE + 0x05U)
#define    P6DR_ADDRESS    (PxDR_BASE + 0x06U)
#define    P7DR_ADDRESS    (PxDR_BASE + 0x07U)

#define    GPIO_P0DR_ADDRESS    (PxDR_BASE + 0x00U)
#define    GPIO_P1DR_ADDRESS    (PxDR_BASE + 0x01U)
#define    GPIO_P2DR_ADDRESS    (PxDR_BASE + 0x02U)
#define    GPIO_P3DR_ADDRESS    (PxDR_BASE + 0x03U)
#define    GPIO_P4DR_ADDRESS    (PxDR_BASE + 0x04U)
#define    GPIO_P5DR_ADDRESS    (PxDR_BASE + 0x05U)
#define    GPIO_P6DR_ADDRESS    (PxDR_BASE + 0x06U)
#define    GPIO_P7DR_ADDRESS    (PxDR_BASE + 0x07U)

